app/Controllers/AccionsController.php

   public function getArea()
   {
      $areas = new AreasModel();
      $data = $areas->findAll();
---
SELECT *
FROM `area`

   public function getCategory()
   {
      $category = new CategoryModel();
      $data = $category->findAll();
---
SELECT *
FROM `category`