app/Models/AdminModel.php

SELECT `users`.`name`, `users`.`firstName`, `users`.`lastName`, `audit`.`audit_title`, `audit`.`date`, `audit`.`id_audit`
FROM `users`
JOIN `audit` ON `users`.`id_user` = `audit`.`fk_auditor`
WHERE `audit`.`id_supervisor` = '21'
AND `audit`.`fk_status` = 0
OR `audit`.`fk_status` = 1
---
    public function GetDataOfAccions($idSupervisor)
    {
        return $this->select([
                'users.name',
                'users.firstName',
                'users.lastName',
                'audit.audit_title',
                'audit.date',
                'audit.id_audit'
            ])
            ->join('audit', 'users.id_user = audit.fk_auditor') // Realiza el INNER JOIN correctamente
            ->where('audit.id_supervisor', $idSupervisor) // Filtra por el ID del supervisor
            ->where('audit.fk_status', 0) // Filtra por el ID del supervisor
            ->orWhere('audit.fk_status', 1) // Filtra por el ID del supervisor
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array