app/Models/AnswersModel.php

    public function getAcciones($idAudit)
    {
        return $this->select('audit.id_audit, questions.id_question, questions.question, questions.`status`, answers.id_answer, answers.is_complete, answers.answer,
answers.evidence, answers.create_at')
            ->join('questions', 'questions.id_question = answers.fk_question')
            ->join('audit', 'audit.id_audit = questions.fk_audit')
            ->where('audit.id_audit', $idAudit)
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array
---
SELECT `audit`.`id_audit`, `questions`.`id_question`, `questions`.`question`, `questions`.`status`, `answers`.`id_answer`, `answers`.`is_complete`, `answers`.`answer`, `answers`.`evidence`, `answers`.`create_at`, `users`.`name`, `users`.`firstName`, `users`.`lastName`
FROM `answers`
JOIN `questions` ON `questions`.`id_question` = `answers`.`fk_question`
JOIN `audit` ON `audit`.`id_audit` = `questions`.`fk_audit`
JOIN `users` ON `users`.`id_user` = `audit`.`fk_auditor`
WHERE `audit`.`id_audit` = '67'