app/Models/AreasModel.php

    public function getArea()
    {
        // Construiendo la consulta SQL directamente
        $builder = $this->builder();
        $builder->select('*');
        $query = $builder->get();
---
SELECT *
FROM `area`

    public function getDepartamentById($idArea)
    {

        return $this->select('area.id_area, area.area, area.`status`, department.id_department, department.department')
            ->join('department', 'department.fk_area = area.id_area') // Realiza el INNER JOIN
            ->where('area.id_area', $idArea) // Filtra por el estado de la auditoría
            ->where('area.`status`', 1) // Filtra por el estado del departamento
            ->where('department.`status', 1) // Filtra por el estado del departamento
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array
---
SELECT `area`.`id_area`, `area`.`area`, `area`.`status`, `department`.`id_department`, `department`.`department`
FROM `area`
JOIN `department` ON `department`.`fk_area` = `area`.`id_area`
WHERE `area`.`id_area` = '5'
AND `area`.`status` = 1
AND `department`.`status` = 1