app/Models/AuditModel.php

SELECT `audit`.`id_audit`, `audit`.`no_audit`, `audit`.`date`, `audit`.`audit_title`, `audit`.`fk_status`, `users`.`name`, `id_audit`, `users`.`firstName`, `users`.`lastName`, `department`.`department`, `machinery`.`machinery`, `shift`.`shift`
FROM `audit`
JOIN `users` ON `users`.`id_user` = `audit`.`fk_auditor`
JOIN `department` ON `department`.`id_department` = `audit`.`fk_department`
JOIN `machinery` ON `machinery`.`id_machinery` = `audit`.`fk_machinery`
JOIN `shift` ON `shift`.`id_shift` = `audit`.`fk_shift`
WHERE `audit`.`id_audit` = '42'
AND `audit`.`fk_status` = 2
AND `department`.`status` = 1
---
    public function getAuditFinished($id): mixed
    {
        return $this->select('audit.id_audit, audit.no_audit, audit.date, audit.audit_title, audit.`fk_status`, users.`name`,id_audit, users.firstName, users.lastName,
 department.department, machinery.machinery, shift.shift')
            ->join('users', 'users.id_user = audit.fk_auditor')  // Asegura que el auditor esté relacionado
            ->join('department', 'department.id_department = audit.fk_department') // INNER JOIN con department
            ->join('machinery', 'machinery.id_machinery = audit.fk_machinery') // INNER JOIN con Machinery
            ->join('shift', 'shift.id_shift = audit.fk_shift') // INNER JOIN con Shift
            ->where('audit.id_audit', $id) // Filtra por el ID de la auditoría
            ->where('audit.fk_status', 2) // Filtra por el estado de la auditoría
            ->where('department.status', 1) // Filtra por el estado del departmento
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array

SELECT `audit`.`id_audit`, `audit`.`id_supervisor`, `audit`.`comment`, `reviewer`.`email` AS `reviewer_email`, `answers`.`answer`, `questions`.`question`, `actions`.`action_description`, `actions`.`evidence_accion`, `follow_up`.`follow_up`, `follow_up`.`is_resolved`
FROM `audit`
JOIN `users` AS `auditor` ON `auditor`.`id_user` = `audit`.`fk_auditor`
JOIN `users` AS `reviewer` ON `reviewer`.`id_user` = `audit`.`reviewed_by`
JOIN `questions` ON `audit`.`id_audit` = `questions`.`fk_audit`
JOIN `answers` ON `answers`.`fk_question` = `questions`.`id_question`
JOIN `actions` ON `actions`.`fk_answer` = `answers`.`id_answer`
JOIN `follow_up` ON `follow_up`.`fk_accions` = `actions`.`id_actions`
WHERE `audit`.`id_audit` = '42'
AND `audit`.`fk_status` = 0
OR `audit`.`fk_status` = 1
---
    public function getAuditVerification($auditId)
    {
        return $this->select('
            audit.id_audit,
            audit.id_supervisor,
            audit.comment,
            reviewer.email AS reviewer_email,
            answers.answer,
            questions.question,
            actions.action_description,
            actions.evidence_accion,
            follow_up.follow_up,
            follow_up.is_resolved
        ')
            ->join('users AS auditor', 'auditor.id_user = audit.fk_auditor')
            ->join('users AS reviewer', 'reviewer.id_user = audit.reviewed_by')
            ->join('questions', 'audit.id_audit = questions.fk_audit')
            ->join('answers', 'answers.fk_question = questions.id_question')
            ->join('actions', 'actions.fk_answer = answers.id_answer')
            ->join('follow_up', 'follow_up.fk_accions = actions.id_actions')
            ->where('audit.id_audit', $auditId)
            ->where('audit.fk_status', 0)
            ->orWhere('audit.fk_status', 1)

SELECT `audit`.`id_audit`, `audit`.`audit_title`, `audit`.`created_at`, `audit`.`created_at`, `audit`.`updated_at`, `department`.`department`
FROM `audit`
JOIN `department` ON `department`.`id_department` = `audit`.`fk_department`
---
    public function getAuditForId()
    {
        return $this->select('audit.id_audit, audit.audit_title, audit.created_at, audit.created_at, audit.updated_at, department.department')
            ->join('department', 'department.id_department = audit.fk_department')
            ->findAll();