app/Models/AuditModel.php

SELECT `id_audit`, `no_audit`, `fk_machinery`, `fk_shift`, `DATE`, `id_audit` `fk_departament`, `auditor`, `STATUS`, `fk_user`
FROM `audit`
WHERE `audit`.`fk_user` = '18'
AND `audit`.`status` = 1
---
    public function getAuditByStatus($idUser)
    {
        return $this->select('id_audit, no_audit, audit_tittle, fk_machinery, fk_shift, DATE, fk_department, auditor, STATUS, fk_user ')
            ->where('audit.fk_user', value: $idUser) // Filtra por el id del usuario
            ->where('audit.`status`', 1) // Filtra por el estado de la auditoria
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array

SELECT `audit`.`id_audit`, `audit`.`no_audit`, `audit`.`audit_title`, `users`.`firstName`, `users`.`lastName`, `audit`.`date`, `audit`.`fk_auditor`, `audit`.`status`, `department`.`department`, `machinery`.`machinery`, `shift`.`shift`
FROM `audit`
JOIN `users` ON `users`.`id_user` = `audit`.`fk_auditor`
JOIN `department` ON `department`.`id_department` = `audit`.`fk_department`
JOIN `machinery` ON `machinery`.`id_machinery` = `audit`.`fk_machinery`
JOIN `shift` ON `shift`.`id_shift` = `audit`.`fk_shift`
WHERE `audit`.`status` = 1
AND `department`.`status` = 1
---
    public function getDataOfAudits()
    {
        return $this->select('audit.id_audit, audit.no_audit, audit.audit_title, users.firstName, users.lastName,
            audit.date, audit.fk_auditor, audit.status, department.department, machinery.machinery, shift.shift')
            ->join('users', 'users.id_user = audit.fk_auditor')  // Asegura que el auditor esté relacionado
            ->join('department', 'department.id_department = audit.fk_department') // Realiza el INNER JOIN
            ->join('machinery', 'machinery.id_machinery = audit.fk_machinery') // Realiza el INNER JOIN
            ->join('shift', 'shift.id_shift = audit.fk_shift') // Realiza el INNER JOIN
            ->where('audit.status', 1) // Filtra por el estado de la auditoría
            ->where('department.status', 1) // Filtra por el estado del department
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array