app/Models/AuthModel.php

SELECT `id_user`, `email`, `name`, `firstName`, `lastName`, `status`, `password`, `privileges`
FROM `users`
WHERE `email` = 'juanjosedomingues@gmail.com'
AND `status` = 1
---
    public function authenticate($email, $password)
    {
        // Construyendo la consulta SQL para buscar el usuario por email y estado activo
        $builder = $this->builder();
        $builder->select('id_user, email, name, firstName, lastName, status, password, fk_role');
        $builder->where('email', $email);
        $builder->where('status', 1); // Solo usuarios activos
        $user = $builder->get()->getFirstRow(); // Obtiene el primer resultado de la consulta

SELECT `users`.`id_user`, `users`.`email`, `users`.`name`, `users`.`firstName`, `users`.`lastName`, `area`.`area`, `department`.`department`, `users`.`status`, `users`.`created_at`, `users`.`updated_at`
FROM `users`
JOIN `department` ON `department`.`id_department` = `users`.`fk_department`
JOIN `area` ON `area`.`id_area` = `department`.`fk_area`
---
    public function getUsers()
    {
        return $this->select('users.id_user, users.email, users.name, users.firstName, users.lastName, area.area, department.department, users.`status`,
users.created_at, users.updated_at, role.id_role, role.`role`')  // Selecciona todos los campos de ambas tablas
            ->join('department', 'department.id_department = users.fk_department') // Realiza el INNER JOIN
            ->join('area', 'area.id_area = department.fk_area') // Realiza el INNER JOIN
            ->join('role', 'role.id_role = users.fk_role') // Realiza el INNER JOIN
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array

SELECT `users`.`id_user`, `users`.`email`, `users`.`name`, `users`.`firstName`, `users`.`lastName`, `area`.`area`, `department`.`department`, `users`.`fk_department`, `users`.`status`, `users`.`created_at`, `users`.`updated_at`
FROM `users`
JOIN `department` ON `department`.`id_department` = `users`.`fk_department`
JOIN `area` ON `area`.`id_area` = `department`.`fk_area`
WHERE `users`.`id_user` = '13'
---
    public function getUsersByNumbre($id)
    {
        return $this->select('users.id_user, users.email, users.name, users.firstName, users.lastName, area.area, area.id_area, department.department, users.fk_department, users.`status`,
         users.created_at, users.updated_at')
            ->join('department', 'department.id_department = users.fk_department') // Realiza el INNER JOIN
            ->join('area', 'area.id_area = department.fk_area') // Realiza el INNER JOIN
            ->where('users.id_user', $id)  // Usa coma en lugar de => para el método where
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array