app/Models/QuestionsModel.php

    public function showAllQuestions()
    {
        $builder = $this->db->table('questions');
        $builder->select('questions.id_question, questions.question, questions.create_for, questions.status, fountain.fountain, category.category')
            ->join('category', 'questions.fk_category = category.id_category') // Corrección en la clave foránea
            ->join('fountain', 'questions.fk_fountain = fountain.id_fountain') // Corrección en la clave foránea
            ->where('questions.status', 1) // Solo preguntas activas
            ->orderBy('category.category', 'ASC');
        $query = $builder->get();
---
SELECT `questions`.`id_question`, `questions`.`question`, `questions`.`create_for`, `questions`.`status`, `fountain`.`fountain`, `category`.`category`
FROM `questions`
JOIN `category` ON `questions`.`fk_category` = `category`.`id_category`
JOIN `fountain` ON `questions`.`fk_fountain` = `fountain`.`id_fountain`
WHERE `questions`.`status` = 1
ORDER BY `category`.`category` ASC

    public function auditForUser($id_audit)
    {
        return $this->select('audit.audit_tittle, audit.auditor, shift.shift, machinery.machinery, departament.departament,
                            category.category, questions.question, questions.id_question, questions.create_at, fountain.fountain, audit.no_audit,
                            audit.id_audit, audit.fk_user, audit.`status`, audit.date, audit.id_audit')
            ->join('fountain', 'fountain.id_fountain = questions.fk_fountain') // INNER JOIN
            ->join('category', 'category.id_category = questions.fk_category') // INNER JOIN
            ->join('audit', 'questions.fk_audit = audit.id_audit') // INNER JOIN
            ->join('users', 'users.id_user = audit.fk_user') // INNER JOIN
            ->join('shift', 'audit.fk_shift = shift.id_shift') // INNER JOIN
            ->join('machinery', 'machinery.id_machinery = audit.fk_machinery') // INNER JOIN
            ->join('departament', 'departament.id_departament = audit.fk_departament') // INNER JOIN
            ->where('audit.id_audit', $id_audit) // Filtra por el id del usuario
            ->where('audit.status', 1) // Filtra por el estado de la auditoría
            ->get()
            ->getResultArray(); // Devuelve el resultado como un array
---
SELECT `audit`.`audit_tittle`, `audit`.`auditor`, `shift`.`shift`, `machinery`.`machinery`, `departament`.`departament`, `category`.`category`, `questions`.`question`, `questions`.`id_question`, `questions`.`create_at`, `fountain`.`fountain`, `audit`.`no_audit`, `audit`.`id_audit`, `audit`.`fk_user`, `audit`.`status`, `audit`.`date`, `audit`.`id_audit`
FROM `questions`
JOIN `fountain` ON `fountain`.`id_fountain` = `questions`.`fk_fountain`
JOIN `category` ON `category`.`id_category` = `questions`.`fk_category`
JOIN `audit` ON `questions`.`fk_audit` = `audit`.`id_audit`
JOIN `users` ON `users`.`id_user` = `audit`.`fk_user`
JOIN `shift` ON `audit`.`fk_shift` = `shift`.`id_shift`
JOIN `machinery` ON `machinery`.`id_machinery` = `audit`.`fk_machinery`
JOIN `departament` ON `departament`.`id_departament` = `audit`.`fk_departament`
WHERE `audit`.`id_audit` = '15'
AND `audit`.`status` = 1